In [5]:
import pandas as pd

In [6]:
%load_ext numpy_html

In [7]:
%%html
<style>
table {margin-top: 16pt;}
td {font-family: Arial, Helvetica, sans-serif !important; font-weight: 600; white-space: normal !important;}
tr:nth-child(even) {background: #b0d9eb !important; color: black}
tr:nth-child(odd) {background: #8fb1bf !important; color: black}
</style>

In [8]:
# Read the Excel file into a DataFrame
df = pd.read_csv("data_salaries_india.csv")
df.head()

,Company Name,Job Title,Role,Salaries Reported,Location,Salary
0,Axis Bank,Data Scientist,Specialist,3,Bangalore,"₹11,71,687/yr"
1,Globex Digital Solutions,Machine Learning Engineer,Manager,1,Hyderabad,"₹32,57,305/yr"
2,Tempworks Services,Data Scientist,Manager,1,Bangalore,"₹58,11,205/yr"
3,BlueOptima,Machine Learning Engineer,Specialist,2,Bangalore,"₹11,80,965/yr"
4,Dell Technologies,Data Analyst,Specialist,5,New Delhi,"₹6,02,930/yr"

In [9]:
df['Salary'] = df['Salary'].str.replace('₹', '')
df['Salary'] = df['Salary'].str.replace('/yr', '')
df['Salary'] = df['Salary'].str.replace(',', '')
df.head()

,Company Name,Job Title,Role,Salaries Reported,Location,Salary
0,Axis Bank,Data Scientist,Specialist,3,Bangalore,1171687
1,Globex Digital Solutions,Machine Learning Engineer,Manager,1,Hyderabad,3257305
2,Tempworks Services,Data Scientist,Manager,1,Bangalore,5811205
3,BlueOptima,Machine Learning Engineer,Specialist,2,Bangalore,1180965
4,Dell Technologies,Data Analyst,Specialist,5,New Delhi,602930

In [10]:
df['Salary'] = df['Salary'].astype(int)
df['Monthly Salary'] = df['Salary'] / 12
df['Hourly Salary'] = df['Salary'] / 2080
df.head()

,Company Name,Job Title,Role,Salaries Reported,Location,Salary,Monthly Salary,Hourly Salary
0,Axis Bank,Data Scientist,Specialist,3,Bangalore,1171687,97640.583333,563.311058
1,Globex Digital Solutions,Machine Learning Engineer,Manager,1,Hyderabad,3257305,271442.083333,1566.012019
2,Tempworks Services,Data Scientist,Manager,1,Bangalore,5811205,484267.083333,2793.848558
3,BlueOptima,Machine Learning Engineer,Specialist,2,Bangalore,1180965,98413.750000,567.771635
4,Dell Technologies,Data Analyst,Specialist,5,New Delhi,602930,50244.166667,289.870192

In [11]:
common_job_titles = df['Job Title'].value_counts().head(5)
balance_job_titles = df['Job Title'].value_counts(normalize=True)
common_job_titles

Job Title
Data Scientist               2165
Data Analyst                 1167
Data Engineer                 948
Machine Learning Engineer     683
Data Science                   54
Name: count, dtype: int64

In [12]:
common_companies = df['Company Name'].value_counts().head(5)
balance_companies = df['Company Name'].value_counts(normalize=True)
common_companies

Company Name
Tata Consultancy Services    51
Accenture                    39
Amazon                       35
Fresher                      31
First Student                30
Name: count, dtype: int64

In [13]:
common_locations = df['Location'].value_counts().head(10)
balance_locations = df['Location'].value_counts(normalize=True)
common_locations

Location
Bangalore    1858
Pune          966
Hyderabad     786
New Delhi     781
Mumbai        736
Name: count, dtype: int64